export const quizData = {
  Єгиптянин: {
    image: "images/egypts.jpg",
    questions: [
      // {
      //   question: "Яка річка була головною для життя Стародавнього Єгипту?",
      //   options: ["Тигр", "Євфрат", "Ніл", "Йордан"],
      //   correct: 2,
      // },
      // {
      //   question: "Як називали правителів Єгипту?",
      //   options: ["Шахи", "Імператори", "Фараони", "Князі"],
      //   correct: 2,
      // },
      // {
      //   question: "Який писемний знак використовували єгиптяни?",
      //   options: ["Латиниця", "Клинопис", "Ієрогліфи", "Руни"],
      //   correct: 2,
      // },
      // {
      //   question: "Яка найбільша піраміда збереглася до наших часів?",
      //   options: ["Піраміда Джосера", "Піраміда Хеопса", "Піраміда Мікеріна", "Піраміда Снофру"],
      //   correct: 1,
      // },
      // {
      //   question: "Як називалася релігія єгиптян?",
      //   options: ["Християнство", "Будизм", "Політеїзм", "Іудаїзм"],
      //   correct: 2,
      // },
      // {
      //   question: "Як називали споруди для гробниць фараонів у долині Нілу?",
      //   options: ["Храми", "Піраміди", "Зикурати", "Кургани"],
      //   correct: 1,
      // },
      // {
      //   question: "Який камінь допоміг ученим розшифрувати єгипетські ієрогліфи?",
      //   options: ["Чорний обеліск", "Розетський камінь", "Синайський камінь", "Камінь Менеса"],
      //   correct: 1,
      // },
      // {
      //   question: "Яка рослина слугувала для виготовлення паперу в Єгипті?",
      //   options: ["Фінікова пальма", "Лотос", "Папірус", "Тростина"],
      //   correct: 2,
      // },
      // {
      //   question: "Який процес збереження тіл застосовували єгиптяни?",
      //   options: ["Кремування", "Заморожування", "Муміфікація", "Обкурювання"],
      //   correct: 2,
      // },
      {
        question: "Як називали спеціальних писарів у Стародавньому Єгипті?",
        options: ["Мудреці", "Секретарі-писарі", "Астрологи", "Пророки"],
        correct: 1,
      },
      {
        question:
          "Який головний колір використовували єгиптяни для розписів у гробницях, щоб символізувати життя?",
        options: ["Жовто-блакитний", "Білий", "Зелений", "Синій"],
        correct: 2,
      },
    ],
  },
  Грек: {
    image: "images/greeks.jpg",
    questions: [
      // {
      //   question: "Який грецький бог був володарем Олімпу?",
      //   options: ["Арес", "Посейдон", "Зевс", "Аїд"],
      //   correct: 2,
      // },
      // {
      //   question: "Де відбувалися перші Олімпійські ігри?",
      //   options: ["Афіни", "Спарта", "Олімпія", "Коринф"],
      //   correct: 2,
      // },
      // {
      //   question: "Яку відому філософську школу заснував Платон в Афінах?",
      //   options: ["Ліцей", "Академія", "Стоа", "Кініки"],
      //   correct: 1,
      // },
      {
        question: "Хто написав епічні поеми «Іліада» та «Одіссея»?",
        options: ["Софокл", "Гомер", "Есхіл", "Геродот"],
        correct: 1,
      },
    ],
  },
  Римлянин: {
    image: "images/romans.jpg",
    questions: [
      // {
      //   question: "Яка відома споруда використовувалась для гладіаторських боїв у Римі?",
      //   options: ["Пантеон", "Колізей", "Форум", "Терми Каракалли"],
      //   correct: 1,
      // },
      // {
      //   question: "Хто був першим імператором Римської імперії?",
      //   options: ["Юлій Цезар", "Нерон", "Октавіан Август", "Траян"],
      //   correct: 2,
      // },
      // {
      //   question: "Яку головну мову використовували в Римській імперії?",
      //   options: ["Грецька", "Латинська", "Гебрейська", "Арамейська"],
      //   correct: 1,
      // },
      {
        question: "Як називалися римські легіонери?",
        options: ["Спартанці", "Легіони", "Центурії", "Декурії"],
        correct: 1,
      },
    ],
  },
  Єврей: {
    image: "images/hebrews.jpg",
    questions: [
      // {
      //   question: "Яка головна книга в іудаїзмі?",
      //   options: ["Біблія", "Коран", "Тора", "Веда"],
      //   correct: 2,
      // },
      // {
      //   question: "Хто вивів євреїв з єгипетського рабства?",
      //   options: ["Авраам", "Давид", "Соломон", "Мойсей"],
      //   correct: 3,
      // },
      // {
      //   question: "Де був збудований Перший Храм?",
      //   options: ["Єрусалим", "Ієрихон", "Назарет", "Віфлеєм"],
      //   correct: 0,
      // },
      {
        question: "Яка подія знаменує вихід євреїв з Єгипту?",
        options: ["Пурим", "Песах", "Ханука", "Йом-Кіпур"],
        correct: 1,
      },
    ],
  },
};
