//scripts/quiz.js
export const quizData = {
  Єгиптянин: {
    image: "images/egypts.jpg",
    questions: [
      {
        question: "Який писемний знак використовували єгиптяни?",
        options: ["Латиниця", "Клинопис", "Ієрогліфи", "Руни"],
        correct: 2,
      },
      {
        question: "Як називалася релігія єгиптян?",
        options: ["Християнство", "Будизм", "Політеїзм", "Іудаїзм"],
        correct: 2,
      },
      {
        question: "Який камінь допоміг ученим розшифрувати єгипетські ієрогліфи?",
        options: ["Чорний обеліск", "Розетський камінь", "Синайський камінь", "Камінь Менеса"],
        correct: 1,
      },
      {
        question: "Як називали спеціальних писарів у Стародавньому Єгипті?",
        options: ["Мудреці", "Секретарі-писарі", "Астрологи", "Пророки"],
        correct: 1,
      },
      {
        question:
          "Який головний колір використовували єгиптяни для розписів у гробницях, щоб символізувати життя?",
        options: ["Жовто-блакитний", "Білий", "Зелений", "Синій"],
        correct: 2,
      },
      {
        question: "Суд Божий буде?",
        options: ["50/50", "Не для всіх", "Не буде", "Буде 100%"],
        correct: 3,
      },
      {
        question: "Який суд буде останнім?",
        options: ["Над ангелами", "Над віруючими", "Над нечестивими померлими", "Над Юдеями"],
        correct: 2,
      },
      {
        question: "За що ми отримуємо милість?",
        options: [
          "За наші заслуги",
          "За те, що ми гарні",
          "Це благословення від батьків",
          "Ми отримуємо, не заслуговуючи",
        ],
        correct: 3,
      },
      {
        question: "Де буде останній суд?",
        options: ["На небі", "На землі", "Біля білого престолу", "На Армагедоні"],
        correct: 2,
      },
    ],
  },
  Грек: {
    image: "images/greeks.jpg",
    questions: [
      {
        question:
          "Як у Стародавній Греції називали незалежне місто з власними законами та військом?",
        options: ["Район", "Поліс", "Область", "Громада"],
        correct: 1,
      },
      {
        question: "На якому півострові розташована більшість території Стародавньої Греції?",
        options: ["Балканський", "Аравійський", "Кримський", "Індокитайський"],
        correct: 0,
      },
      {
        question: "Що таке Архімедів гвинт?",
        options: [
          "Пристрій для зберігання зерна",
          "Пристрій для підйому води",
          "Давній музичний інструмент",
          "Вид грецького корабля",
        ],
        correct: 1,
      },
      {
        question: "Як самі себе називали жителі Стародавньої Греції?",
        options: ["Римляни", "Македонці", "Елліни", "Афіняни"],
        correct: 2,
      },
      {
        question:
          "Як називали грецьких мислителів, які шукали відповіді на питання про світ і людину?",
        options: ["Поети", "Вчені", "Філософи", "Думкарі"],
        correct: 2,
      },
      {
        question: "У Біблії життя іноді порівнюють з…",
        options: ["Стрибками", "Бігом", "Плаванням", "Велоперегонами"],
        correct: 1,
      },
      {
        question:
          "Що отримає переможець у звичайних спортивних змаганнях, за словами Павла (1 Кор 9:25)?",
        options: [
          "Велику грошову премію",
          "Вінець, що в’яне",
          "Кришталевий кубок",
          "Нові кросівки",
        ],
        correct: 1,
      },
      {
        question: "Що таке “обтяжувачі” у духовному бігу?",
        options: [
          "Тільки рюкзак із камінням",
          "Будь-що, що нас гальмує",
          "Зайва домашка",
          "Погана погода",
        ],
        correct: 1,
      },
      {
        question: "Марафон у духовному сенсі означає…",
        options: [
          "Віру, яка тримається до кінця",
          "Біг на стадіоні",
          "42 кілометри молитви",
          "Участь у спортивному таборі",
        ],
        correct: 0,
      },
    ],
  },
  Римлянин: {
    image: "images/romans.jpg",
    questions: [
      {
        question: "Хто був засновниками Риму за легендою?",
        options: ["Ромул і Рем", "Цезар і Брут", "Аполлон і Марс", "Август і Нерон"],
        correct: 0,
      },
      {
        question: "Яка мова була основною у Стародавньому Римі?",
        options: ["Грецька", "Латинська", "Єгипетська", "Кельтська"],
        correct: 1,
      },
      {
        question: "Як називався головний майдан Риму?",
        options: ["Форум", "Колізей", "Пантеон", "Палатин"],
        correct: 0,
      },
      {
        question: "Яка споруда була найбільшим амфітеатром Риму?",
        options: ["Пантеон", "Колізей", "Цирк Максимус", "Термополій"],
        correct: 1,
      },
      {
        question: "Який римський імператор проголосив християнство дозволеною релігією?",
        options: ["Нерон", "Костянтин Великий", "Август", "Тиберій"],
        correct: 1,
      },
      {
        question: "Як називалась дорога, що з’єднувала Рим з півднем Італії?",
        options: ["Аппієва дорога", "Східний тракт", "Віа Регіа", "Каміно"],
        correct: 0,
      },
      {
        question: "Який одяг носили римські громадяни?",
        options: ["Хітон", "Тога", "Туніка", "Кімоно"],
        correct: 1,
      },
      {
        question: "Як римляни називали Середземне море?",
        options: ["Mare Romanum", "Mare Nostrum", "Mare Magnum", "Mare Anticum"],
        correct: 1,
      },
      {
        question: "Які римські лазні були популярними серед громадян?",
        options: ["Термальні", "Сауни", "Фінські", "Акведуки"],
        correct: 0,
      },
    ],
  },
  Єврей: {
    image: "images/hebrews.jpg",
    questions: [
      {
        question: "Хто був перший цар Ізраїлю?",
        options: ["Ірод", "Самуїл", "Давид", "Саул"],
        correct: 3,
      },
      {
        question: "З якого коліна Ізраїлю Ісус?",
        options: ["Веніаміна", "Давида", "Соломона", "Саула"],
        correct: 1,
      },
      {
        question: "Скільки орієнтовно людей вийшло з єгипетського рабства?",
        options: ["1 мільйон", "2 мільйони", "3 мільйони", "4 мільйони"],
        correct: 1,
      },
      {
        question: "Під чиєю окупацією жили євреї під час земного життя Ісуса?",
        options: ["Грецька (Македонська)", "Римська", "Єгипетська", "Жодна відповідь не правильна"],
        correct: 1,
      },
      {
        question: "За якого царя Ізраїлю побудували 1-й храм?",
        options: ["Саул", "Давид", "Самуїл", "Соломон"],
        correct: 3,
      },
      {
        question: "Який цар найдовше був при владі?",
        options: ["Єзекія", "Манасія", "Давид", "Осія"],
        correct: 1,
      },
      {
        question: "Хто з перелічених правителів не був царем?",
        options: ["Давид", "Самуїл", "Єровоам", "Ровоам"],
        correct: 1,
      },
      {
        question: "Яких тварин принесли в жертву «Невідомому Богу»?",
        options: ["Ягня", "Бичків", "Коза", "Свиня"],
        correct: 0,
      },
      {
        question: "В якому місті проповідував Апостол Павло перед тим, як прийти в Афіни?",
        options: ["Коринф", "Ефес", "Фесалоніки", "Рим"],
        correct: 2,
      },
    ],
  },
};
